Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ПреподавателиОбученияСУО/ПреподавателиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПреподавателиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПрохожденияОбученияСУО/ПрохожденияОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияОбученияСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноОбщениеМеждуУчастниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПроведениеПреподавателямиОбученияСУО/ПроведениеПреподавателямиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроведениеПреподавателямиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПродолжительностьВЧасах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроцессаПреподаванияСУО</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПросмотрВедомости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПрохожденияПрограммОбученияСУО/ПрохожденияПрограммОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияПрограммОбученияСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийПрограммыОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/УчастникиПрограммОбученияСУО/УчастникиПрограммОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиПрограммОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/АдресатыСообщенийСУО/АдресатыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АдресатыСообщенийСУО</name>
  <enumValues>
    <name>НаФоруме</name>
  </enumValues>
  <enumValues>
    <name>УчастникамМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникамПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>УчастникуМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникуПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>Преподавателям</name>
  </enumValues>
  <enumValues>
    <name>Преподавателю</name>
  </enumValues>
  <enumValues>
    <name>УчебнойГруппе</name>
  </enumValues>
  <enumValues>
    <name>Пользователю</name>
  </enumValues>
  <enumValues>
    <name>Администратору</name>
  </enumValues>
  <enumValues>
    <name>Организатору</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ОрганизаторыСУО/ОрганизаторыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОрганизаторыСУО</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Documents/СообщениеСУО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");
	
	// Примечание: если создается новый документ, то для него всегда
	// Создается новая тема, так как ответы на уже существующие
	// Темы записываются не интерактивно, а программно из формы
	// "ОбсуждениеТемы" справочника ТемыСообщенийСУО.
	
	// Выполняем установку реквизитов и доступность элементов
	//
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Пользователь          = Пользователи.ТекущийПользователь();
		Объект.РодительскоеСообщение = Параметры.РодительскоеСообщение;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если ЗначениеЗаполнено(Объект.РодительскоеСообщение) Тогда
			
			ТекстРодительскогоСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РодительскоеСообщение, "ФорматированныйДокумент").Получить();
			
			Если НЕ ЗначениеЗаполнено(Параметры.Тема) Тогда
				Параметры.Тема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РодительскоеСообщение, "Тема");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Параметры.Контекст)
				И ЗначениеЗаполнено(Параметры.Тема) Тогда
				
				Параметры.Контекст = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Тема, "Контекст");
				
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ЗначениеЗаполнено(Параметры.Тема) Тогда
			
			Объект.Тема = Параметры.Тема;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Кому) Тогда
			
			Кому = Перечисления.АдресатыСообщенийСУО[Параметры.Кому];
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Контекст) Тогда
			
			Контекст = Параметры.Контекст;
			
			Если НЕ ЗначениеЗаполнено(Кому) Тогда
				Кому = Справочники.ТемыСообщенийСУО.АдресатПоКонтексту(Контекст);
			КонецЕсли;
			
			ПредставлениеКонтекста = ПредставлениеКонтекстаСообщения(Кому, Контекст, Объект.Тема, Объект.Пользователь);
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
			
			Если Объект.Шаблон.ЭтоГруппа Тогда
				Текст = НСтр("ru = 'Создание сообщения на основании группы шаблонов не поддерживается'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			КонецЕсли;
			
			НоваяТема = Объект.Шаблон.Заголовок;
			
		КонецЕсли;
		
	Иначе
		
		Кому     = Объект.Тема.Кому;
		Контекст = Объект.Тема.Контекст;
		
		ПредставлениеКонтекста = ПредставлениеКонтекстаСообщения(Кому, Контекст, Объект.Тема, Объект.Пользователь);
		
		МассивФайлов = Новый Массив;
		ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(Объект.Ссылка, МассивФайлов);
		ЕстьФайлы = ?(МассивФайлов.Количество() > 0, Истина, Ложь); 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		
		Элементы.ГруппаСообщение.ТолькоПросмотр = Истина;
		
		Если ЗначениеЗаполнено(Объект.Рассылка) Тогда
			Элементы.ЗначенияПеременных.Видимость = Ложь;
		Иначе
			Элементы.ЗначенияПеременных.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		
		Элементы.Шаблон.Видимость = Ложь; // Заполняется программно
		
		Элементы.ЗначенияПеременных.Видимость = Ложь; // Переменные задаются в рассылке.
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Рассылка) Тогда
		Элементы.Рассылка.Видимость = Ложь;  // Заполняется программно
	КонецЕсли;
	
	// Заполняем список адресатов

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОрганизаторыСУО.Пользователь,
		|	ОрганизаторыСУО.Наименование
		|ИЗ
		|	Справочник.ОрганизаторыСУО КАК ОрганизаторыСУО
		|ГДЕ
		|	ОрганизаторыСУО.ПометкаУдаления = ЛОЖЬ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокАдресатов.Добавить(ВыборкаДетальныеЗаписи.Пользователь, ВыборкаДетальныеЗаписи.Наименование);
	КонецЦикла;
	
	ТаблицаПреподавателей = РегистрыСведений.ПреподавателиОбученияСУО.ВсеПреподавателиПользователя(Пользователи.ТекущийПользователь());
	
	Для каждого СтрокаТП Из ТаблицаПреподавателей Цикл
		СписокАдресатов.Добавить(СтрокаТП.Преподаватель, СтрокаТП.Наименование);
	КонецЦикла;
	
	
	// Заполняем таблицу, определяющую сценарий получения контекста сообщения для
	// Каждого адресата.
	//
	
	// Описание колонок
	
	// Кому                           - значение перечисления "АдресатыСообщенийСУО".
	//                                 По этому значению находится соответствующая строка таблицы.
	
	// ОписаниеИсточника              - строка подставляется в вопрос при необходимости выбрать несколько источников данных
	//                                 в рамках одного адресата (поля Кому).
	//                                 Каждый источник данных задается отдельной строкой таблицы.
	
	// ФормаВыбора                    - форма, которая позволяет выбрать контекст сообщения.
	
	// ИмяРеквизита                   - реквизит данных, переданных из формы выбора (основной или дополнительной
	//                                 при ее наличии), который содержит контекст сообщения      
	
	// ПромежуточнаяФормаВыбора       - форма из которой выбираются дополнительные данные для уточнения контекста.
	//                                 Вызывается при наличии после вывода первой формы выбора.
	
	// ИмяПараметраПромежуточнойФормы - имя параметра, который нужно передать в промежуточную форму,
	//                                 чтобы там отобразился нужный список выбора.
	
	// ИмяПромежуточногоРеквизита     - имя реквизита данных, полученный из основной формы, который
	//                                 нужно передать в промежуточную форму
	
	// Значение                       - предопределенное значение, которое будет подставлено в качестве контекста.
	//
	
	// УчастникамМероприятия
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия;
	НоваяСтрока.ФормаВыбора       = "РегистрСведений.ПрохожденияОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "учащемуся";
	НоваяСтрока.ИмяРеквизита      = "ПроведениеОбучения";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия;
	НоваяСтрока.ФормаВыбора       = "РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "преподавателю";
	НоваяСтрока.ИмяРеквизита      = "ПроведениеОбучения";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия;
	НоваяСтрока.ФормаВыбора       = "Документ.ПроведениеОбученияСУО.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "менеджеру";
	НоваяСтрока.ИмяРеквизита      = "Ссылка";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	// УчастникамПрограммыОбучения
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.УчастникамПрограммыОбучения;
	НоваяСтрока.ФормаВыбора       = "РегистрСведений.ПрохожденияПрограммОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "учащемуся";
	НоваяСтрока.ИмяРеквизита      = "ПроведениеПрограммыОбучения";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.УчастникамПрограммыОбучения;
	НоваяСтрока.ФормаВыбора       = "Документ.ПроведениеПрограммыОбученияСУО.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "менеджеру";
	НоваяСтрока.ИмяРеквизита      = "Ссылка";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);

	// УчебнойГруппе
	
	Если ЭтоОбразовательнаяОрганизация Тогда
	
		НоваяСтрока = ДанныеОКонтексте.Добавить();
		НоваяСтрока.Кому         = Перечисления.АдресатыСообщенийСУО.УчебнойГруппе;
		НоваяСтрока.ФормаВыбора  = "Справочник.УчебныеГруппыОО.ФормаВыбора";
		НоваяСтрока.ИмяРеквизита = "Ссылка";
		НоваяСтрока.Доступность  = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУчебныеГруппыСУО",,Объект.Пользователь), Истина, Ложь);
									 
	Иначе
		 
		НоваяСтрока = ДанныеОКонтексте.Добавить();
		НоваяСтрока.Кому         = Перечисления.АдресатыСообщенийСУО.УчебнойГруппе;
		НоваяСтрока.ФормаВыбора  = "Справочник.УчебныеГруппыСУО.ФормаВыбора";
		НоваяСтрока.ИмяРеквизита = "Ссылка";
		НоваяСтрока.Доступность  = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУчебныеГруппыСУО",,Объект.Пользователь), Истина, Ложь);		 
		 
	 КонецЕсли;						 
									 
	// НаФорум
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому         = Перечисления.АдресатыСообщенийСУО.НаФоруме;
	НоваяСтрока.ФормаВыбора  = "Справочник.РазделыФорумаСУО.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита = "Ссылка";
	НоваяСтрока.Доступность  = Истина;
								 
	// УчастникуМероприятия
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                            = Перечисления.АдресатыСообщенийСУО.УчастникуМероприятия;
	НоваяСтрока.ОписаниеИсточника               = "учащемуся";
	НоваяСтрока.ФормаВыбора                     = "РегистрСведений.ПрохожденияОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                    = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора        = "РегистрСведений.УчастникиОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы  = "ПроведениеОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита      = "ПроведениеОбучения";
	НоваяСтрока.Доступность                     = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                           = Перечисления.АдресатыСообщенийСУО.УчастникуМероприятия;
	НоваяСтрока.ОписаниеИсточника              = "преподавателю";	
	НоваяСтрока.ФормаВыбора                    = "РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                   = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора       = "РегистрСведений.УчастникиОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы = "ПроведениеОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита     = "ПроведениеОбучения";
	НоваяСтрока.Доступность                    = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                           = Перечисления.АдресатыСообщенийСУО.УчастникуМероприятия;
	НоваяСтрока.ОписаниеИсточника              = "менеджеру";	
	НоваяСтрока.ФормаВыбора                    = "Документ.ПроведениеОбученияСУО.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                   = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора       = "РегистрСведений.УчастникиОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы = "ПроведениеОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита     = "Ссылка";
	НоваяСтрока.Доступность                    = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	// УчастникуПрограммыОбучения
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                            = Перечисления.АдресатыСообщенийСУО.УчастникуПрограммыОбучения;
	НоваяСтрока.ОписаниеИсточника               = "учащемуся";
	НоваяСтрока.ФормаВыбора                     = "РегистрСведений.ПрохожденияПрограммОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                    = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора        = "РегистрСведений.УчастникиПрограммОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы  = "ПроведениеПрограммыОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита      = "ПроведениеПрограммыОбучения";
	НоваяСтрока.Доступность                     = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                           = Перечисления.АдресатыСообщенийСУО.УчастникуПрограммыОбучения;
	НоваяСтрока.ОписаниеИсточника              = "менеджеру";	
	НоваяСтрока.ФормаВыбора                    = "Документ.ПроведениеПрограммыОбученияСУО.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                   = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора       = "РегистрСведений.УчастникиПрограммОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы = "ПроведениеПрограммыОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита     = "Ссылка";
	НоваяСтрока.Доступность                    = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
												   
												   
	// Преподавателям
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.Преподавателям;
	НоваяСтрока.ФормаВыбора       = "РегистрСведений.ПрохожденияОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "учащемуся";
	НоваяСтрока.ИмяРеквизита      = "ПроведениеОбучения";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.Преподавателям;
	НоваяСтрока.ФормаВыбора       = "РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "преподавателю";
	НоваяСтрока.ИмяРеквизита      = "ПроведениеОбучения";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому              = Перечисления.АдресатыСообщенийСУО.Преподавателям;
	НоваяСтрока.ФормаВыбора       = "Документ.ПроведениеОбученияСУО.ФормаВыбора";
	НоваяСтрока.ОписаниеИсточника = "менеджеру";
	НоваяСтрока.ИмяРеквизита      = "Ссылка";
	НоваяСтрока.Доступность       = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	
	// Преподавателю
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                            = Перечисления.АдресатыСообщенийСУО.Преподавателю;
	НоваяСтрока.ОписаниеИсточника               = "учащемуся";
	НоваяСтрока.ФормаВыбора                     = "РегистрСведений.ПрохожденияОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                    = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора        = "РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Форма.ФормаВыбораПреподавателяМероприятия";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы  = "ПроведениеОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита      = "ПроведениеОбучения";
	НоваяСтрока.Доступность                     = ?(УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                           = Перечисления.АдресатыСообщенийСУО.Преподавателю;
	НоваяСтрока.ОписаниеИсточника              = "преподавателю";	
	НоваяСтрока.ФормаВыбора                    = "РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Форма.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                   = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора       = "РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Форма.ФормаВыбораПреподавателяМероприятия";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы = "ПроведениеОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита     = "ПроведениеОбучения";	
	НоваяСтрока.Доступность                    = ?(УправлениеОбучениемСУО.ЕстьРольПреподавателя(Объект.Пользователь), Истина, Ложь);
	
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому                           = Перечисления.АдресатыСообщенийСУО.Преподавателю;
	НоваяСтрока.ОписаниеИсточника              = "менеджеру";	
	НоваяСтрока.ФормаВыбора                    = "Документ.ПроведениеОбученияСУО.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита                   = "Ссылка";
	НоваяСтрока.ПромежуточнаяФормаВыбора       = "РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Форма.ФормаВыбораПреподавателяМероприятия";
	НоваяСтрока.ИмяПараметраПромежуточнойФормы = "ПроведениеОбучения";
	НоваяСтрока.ИмяПромежуточногоРеквизита     = "Ссылка";
	НоваяСтрока.Доступность                    = ?(УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Объект.Пользователь), Истина, Ложь);
	
	// Пользователю
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому         = Перечисления.АдресатыСообщенийСУО.Пользователю;
	НоваяСтрока.ФормаВыбора  = "Справочник.Пользователи.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита = "Ссылка";
	НоваяСтрока.Доступность  = ?(УправлениеДоступом.ЕстьРоль("УправлениеУчастникамиОбученияСУО",,Объект.Пользователь), Истина, Ложь);
								 
	// Администратору
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому         = Перечисления.АдресатыСообщенийСУО.Администратору;
	НоваяСтрока.Значение     = Константы.АвторАвтоматическихРассылокСУО.Получить();
	НоваяСтрока.ИмяРеквизита = "Ссылка";
	НоваяСтрока.Доступность  = ?(ЗначениеЗаполнено(НоваяСтрока.Значение), Истина, Ложь);
	
	// Организатору
	
	НоваяСтрока = ДанныеОКонтексте.Добавить();
	НоваяСтрока.Кому         = Перечисления.АдресатыСообщенийСУО.Организатору;
	НоваяСтрока.ФормаВыбора  = "Справочник.ОрганизаторыСУО.ФормаВыбора";
	НоваяСтрока.ИмяРеквизита = "Ссылка";
	НоваяСтрока.Доступность  = ?(СписокАдресатов.Количество() > 0, Истина, Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Устанавливаем параметры выбора элемента формы "Кому"
	//
	
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(Новый ПараметрВыбора("СформироватьДанныеВыбора", Истина));
	
	Если НЕ Пользователи.ЭтоПолноправныйПользователь(Пользователи.ТекущийПользователь()) Тогда
	
		МассивПараметров.Добавить(Новый ПараметрВыбора("УчитыватьНастройки", Истина));
		
		МассивДоступныхЗначений = Новый Массив();
		
		Для каждого СтрокаТДК Из ДанныеОКонтексте Цикл
		
			Если СтрокаТДК.Доступность
				И МассивДоступныхЗначений.Найти(СтрокаТДК.Кому) = Неопределено Тогда
				
				МассивДоступныхЗначений.Добавить(СтрокаТДК.Кому);
				
			КонецЕсли;
		
		КонецЦикла;
		
		МассивПараметров.Добавить(Новый ПараметрВыбора("ДоступныеЗначения", Новый ФиксированныйМассив(МассивДоступныхЗначений)));
		
	КонецЕсли;
	
	Элементы.Кому.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	

	// Устанавливаем заголовок
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.НаФоруме
		И Объект.Ссылка.Пустая() Тогда
		
		Заголовок = НСтр("ru = 'Тема и сообщение (создание)'");
		
	КонецЕсли;
	
	
	// Устанавливаем доступность элементов
	
	УправлениеДоступностьюЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностьюЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Шаблон) И НЕ ТекущийОбъект.Ссылка.Пустая() Тогда
		Сообщение = Документы.СообщениеСУО.ФорматированныйДокументСообщения(ТекущийОбъект.Ссылка);
	Иначе
		Сообщение = ТекущийОбъект.ФорматированныйДокумент.Получить();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Объект.РодительскоеСообщение) Тогда
		ТекстРодительскогоСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РодительскоеСообщение, "ФорматированныйДокумент").Получить();
	КонецЕсли;
	
	// Дополнительные адреса
	
	ДополнительныеАдреса = "";
	Если Объект.ДополнительныеАдреса.Количество() > 0 Тогда
		Для каждого СтрокаДА Из Объект.ДополнительныеАдреса Цикл
			ДополнительныеАдреса = ДополнительныеАдреса + СтрокаДА.АдресЭлектроннойПочты + ", ";
		КонецЦикла;		
		ДополнительныеАдреса = Сред(ДополнительныеАдреса, 1, СтрДлина(ДополнительныеАдреса) - 2);
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ДополнительныеАдреса) Тогда
		Элементы.ДополнительныеАдреса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая()	И (НЕ ЗначениеЗаполнено(Кому) ИЛИ НЕ ЗначениеЗаполнено(Контекст)) Тогда
		
		Текст = НСтр("ru = 'Заполните поле ""Кому"" полностью'");
		Поле = "Кому";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,Поле,,Отказ);
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая()	И НЕ ЗначениеЗаполнено(НоваяТема) И НЕ ЗначениеЗаполнено(Объект.Тема) Тогда
		
		Текст = НСтр("ru = 'Укажите тему сообщения'");
		Поле = "НоваяТема";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,Поле,,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(Сообщение, Новый СжатиеДанных(9));
	
	Если Объект.Ссылка.Пустая()
		И НЕ ЗначениеЗаполнено(Объект.Тема) Тогда

		УстановитьПривилегированныйРежим(Истина);
		
		НоваяТемаОбъект = Справочники.ТемыСообщенийСУО.СоздатьЭлемент();
		НоваяТемаОбъект.Наименование = НоваяТема;
		НоваяТемаОбъект.Контекст     = Контекст;
		НоваяТемаОбъект.Автор        = Объект.Пользователь;
		НоваяТемаОбъект.Кому         = Кому;
		
		НоваяТемаОбъект.Записать();
		
		ТекущийОбъект.Тема                 = НоваяТемаОбъект.Ссылка;
		ТекущийОбъект.ПервоеСообщениеВТеме = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТипЗнч(ИнформацияОПрикрепленныхФайлах) = Тип("ФиксированныйМассив") Тогда
		
		Для каждого ИнформацияОПрикрепленномФайле Из ИнформацияОПрикрепленныхФайлах Цикл
			
			// Создадим карточку Файла в БД
			ПрисоединенныеФайлы.ДобавитьФайл(
				ТекущийОбъект.Ссылка,
				ИнформацияОПрикрепленномФайле.ИмяБезРасширения,
				ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ИнформацияОПрикрепленномФайле.Расширение),
				,
				,
				ИнформацияОПрикрепленномФайле.Адрес);
				
			ЕстьФайлы = Истина;
				
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ИнформацияОПрикрепленныхФайлах = Неопределено;
	Элементы.ИнформацияОПрикрепленномФайле.Заголовок = "";	
	УправлениеДоступностьюЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписаноСообщениеОбсуждения", Контекст);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() И НЕ Объект.Проведен И НЕ ПользовательСогласилсяЗакрытьНепроведенныйДокумент Тогда
		
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемПродолжение", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Это сообщение не отправлено. Отправить сообщение?'"), РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда						
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
    КонецЕсли;

	Если Результат = КодВозвратаДиалога.Нет Тогда
		ПользовательСогласилсяЗакрытьНепроведенныйДокумент = Истина;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КомуПриИзменении(Элемент)
	
	УправлениеДоступностьюЭлементовФормы();
	
	Контекст        = Неопределено;
	ПредставлениеКонтекста = "";
	
	НайденныеСтроки = ДанныеОКонтексте.НайтиСтроки(Новый Структура("Кому, Доступность", Кому, Истина));
	
	Если НайденныеСтроки.Количество() = 1 И ЗначениеЗаполнено(НайденныеСтроки[0].Значение) Тогда
		
		Контекст               = ПолучитьКонтекстСообщения(НайденныеСтроки[0].Значение, НайденныеСтроки[0].ИмяРеквизита);
		ПредставлениеКонтекста = ПредставлениеКонтекстаСообщения(Кому, Контекст, Объект.Тема, Объект.Пользователь);
		
		Элементы.ВыбратьКонтекст.Доступность = Ложь;
		
	Иначе
		
		Элементы.ВыбратьКонтекст.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьКонтекст(Команда)
	
	НайденныеСтроки = ДанныеОКонтексте.НайтиСтроки(Новый Структура("Кому, Доступность", Кому, Истина));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Нарушение прав доступа'"));
		Возврат;
		
	ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
		
		ВыбратьКонтекстПослеВыбораИсточника(0, НайденныеСтроки); 
		
	Иначе
		
		ТекстВопроса = НСтр("ru = 'Выбрать из мероприятий, которые доступны мне как...'");
		
		Кнопки = Новый СписокЗначений;
		
		Индекс = 0;
		Для каждого Элемент Из НайденныеСтроки Цикл
		
			Кнопки.Добавить(Индекс, Элемент.ОписаниеИсточника);
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		Оповещение = Новый ОписаниеОповещения("ВыбратьКонтекстПослеВыбораИсточника", ЭтотОбъект, НайденныеСтроки);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки,, 0, НСтр("ru = 'Выбор источника данных'"));

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтекстПослеВыбораИсточника(ВыбранныйИсточник, НайденныеСтроки) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьКонтекстПослеВыбораПервогоЗначения", ЭтотОбъект, НайденныеСтроки[ВыбранныйИсточник]);	
	ОткрытьФорму(НайденныеСтроки[ВыбранныйИсточник].ФормаВыбора, Новый Структура("РежимВыбора, ПоказатьДоступныеДляОбщения", Истина, Истина),,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтекстПослеВыбораПервогоЗначения(ВыбранноеЗначение, ПараметрыКонтекста) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыКонтекста.ПромежуточнаяФормаВыбора)
		И ВыбранноеЗначение <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура(ПараметрыКонтекста.ИмяПараметраПромежуточнойФормы, ПолучитьКонтекстСообщения(ВыбранноеЗначение, ПараметрыКонтекста.ИмяПромежуточногоРеквизита));
		
		Оповещение = Новый ОписаниеОповещения("ВыбратьКонтекстОкончениеВыбора", ЭтотОбъект, ПараметрыКонтекста.ИмяРеквизита);
		ОткрытьФорму(ПараметрыКонтекста.ПромежуточнаяФормаВыбора, ПараметрыФормы,,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Иначе
	
	    ВыбратьКонтекстОкончениеВыбора(ВыбранноеЗначение, ПараметрыКонтекста.ИмяРеквизита);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтекстОкончениеВыбора(ВыбранноеЗначение, ИмяРеквизита) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Контекст               = ПолучитьКонтекстСообщения(ВыбранноеЗначение, ИмяРеквизита);
		ПредставлениеКонтекста = ПредставлениеКонтекстаСообщения(Кому, Контекст, Объект.Тема, Объект.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАдресатаИзСписка(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораАдресата", ЭтотОбъект);
	СписокАдресатов.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите адресата'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораАдресата(ВыбранноеЗначение, Параметры) Экспорт
	Если ВыбранноеЗначение <> Неопределено Тогда
		Контекст               = ВыбранноеЗначение.Значение;
		ПредставлениеКонтекста = ПредставлениеКонтекстаСообщения(Кому, Контекст, Объект.Тема, Объект.Пользователь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрикрепитьФайлПродолжение", ЭтотОбъект);	
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаФайловСУ", Новый Структура("УникальныйИдентификаторФормыВладельца, ИнформацияОПрикрепленныхФайлах", УникальныйИдентификатор, ИнформацияОПрикрепленныхФайлах),,,,,ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивПрикрепленныхФайлов = Новый Массив;
	
	Для каждого Строка Из РезультатЗакрытия Цикл
		
		ОписаниеФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Строка.ПолноеИмя);
		ОписаниеФайла.Вставить("Адрес", Строка.АдресВХранилище);
		
		МассивПрикрепленныхФайлов.Добавить(ОписаниеФайла);
	
	КонецЦикла;
	
	ИнформацияОПрикрепленныхФайлах = Новый ФиксированныйМассив(МассивПрикрепленныхФайлов); // Запоминаем в реквизите формы
	
	Элементы.ИнформацияОПрикрепленномФайле.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Прикреплено файлов: %1'"), ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ИнформацияОПрикрепленныхФайлах.Количество()));
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеФайлы(Команда)
	ПараметрыФормы = Новый Структура("ВладелецФайла, ТолькоПросмотр", Объект.Ссылка, Истина);
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УправлениеДоступностьюЭлементовФормы()
	
	Если ЗначениеЗаполнено(Кому) Тогда
		Элементы.ВыбратьКонтекст.Доступность = Истина;
	Иначе
		Элементы.ВыбратьКонтекст.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностьюЭлементовФормыНаСервере()
	
	ЭтоГрупповоеОбсуждение = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(Кому);
	
	// Общее
	
	Элементы.ГруппаРодительскоеСообщение.Видимость = ЗначениеЗаполнено(Объект.РодительскоеСообщение);
	
	// Тема
	
	Элементы.Тема.Видимость = ЗначениеЗаполнено(Объект.Тема);
	Элементы.НоваяТема.Видимость = НЕ ЗначениеЗаполнено(Объект.Тема);
	
	// Адресаты
	
	Элементы.ГруппаКому.ТолькоПросмотр = ЗначениеЗаполнено(Контекст);
	
	Элементы.Кому.ТолькоПросмотр = ЗначениеЗаполнено(Параметры.Кому); // Жестко задано при открытии
	
	Если НЕ ЭтоГрупповоеОбсуждение
		И (Элементы.Кому.ТолькоПросмотр ИЛИ НЕ Объект.Ссылка.Пустая() ИЛИ ЗначениеЗаполнено(Объект.РодительскоеСообщение)) Тогда
		
		Элементы.Кому.Видимость = Ложь; // Для записанных писем или когда жестко задано при открытии
		Элементы.ПредставлениеКонтекста.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		
	КонецЕсли;
	
	НастройкиАдресатаПользователю = ДанныеОКонтексте.НайтиСтроки(Новый Структура("Кому", Перечисления.АдресатыСообщенийСУО.Пользователю));
	
	ЕстьПравоВыборкаПользователей = Пользователи.РолиДоступны("ЛичныйКабинетКаталогПользователейСУО", Пользователи.ТекущийПользователь(), Ложь);
	
	// ВыбратьАдресатаИзСписка
	
	Если НастройкиАдресатаПользователю.Количество() = 1
		И Элементы.Кому.ТолькоПросмотр
		И Кому = Перечисления.АдресатыСообщенийСУО.Пользователю Тогда
		
		Элементы.ВыбратьАдресатаИзСписка.Видимость = Истина;	
		
	Иначе
		
		Элементы.ВыбратьАдресатаИзСписка.Видимость = Ложь;	
		
	КонецЕсли;
	
	// ВыбратьКонтекст
	
	Если ЗначениеЗаполнено(Контекст) Тогда
		
		Элементы.ВыбратьКонтекст.Видимость = Ложь;
		
	Иначе
	
		Если НастройкиАдресатаПользователю.Количество() = 1
			И Элементы.Кому.ТолькоПросмотр
			И Кому = Перечисления.АдресатыСообщенийСУО.Пользователю Тогда

			Если НастройкиАдресатаПользователю[0].Доступность Тогда
				Элементы.ВыбратьКонтекст.Видимость = ЕстьПравоВыборкаПользователей;
			Иначе
				Элементы.ВыбратьКонтекст.Видимость = Ложь;
			КонецЕсли;

		Иначе

			Элементы.ВыбратьКонтекст.Видимость = ЕстьПравоВыборкаПользователей;

		КонецЕсли;
		
	КонецЕсли;
	
	// Файлы
	
	Элементы.ПрикрепленныеФайлы.Видимость = ЕстьФайлы;
	Элементы.ГруппаНовыйФайл.Видимость = Объект.Ссылка.Пустая();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтекстСообщения(ЗначениеВыбора, ИмяРеквизита) Экспорт
	
	Если ЗначениеВыбора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУ.ЗначениеРеквизитаВПривилегированномРежиме(ЗначениеВыбора, ИмяРеквизита);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеКонтекстаСообщения(Кому, Контекст, Тема, Пользователь) Экспорт
	
	ЭтоГрупповоеОбсуждение = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(Кому);
	
	Если ЭтоГрупповоеОбсуждение
		ИЛИ НЕ ЗначениеЗаполнено(Тема) Тогда
	
		Возврат Документы.СообщениеСУО.ПредставлениеКонтекстаСообщения(Кому, Контекст);
		
	Иначе
		
		АвторТемы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тема, "Автор");
		
		Если АвторТемы = Пользователь Тогда
			Возврат Документы.СообщениеСУО.ПредставлениеКонтекстаСообщения(Кому, Контекст);
		Иначе
			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АвторТемы, "Наименование");
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции




#КонецОбласти
